tutorials/secondOrderIBMStudy/secondOrderIBMGrid500/system/globalVariables
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    This file contains parameter definitions used to define the case's 
    boundary conditions, coefficient calculation, etc.
    All variables start with prefix "gV_" to easily identify them in other files
    and to avoid accidentical variable overrides

\*---------------------------------------------------------------------------*/

// To include this file to any other dictionary: "include "system/globalVariables"

// Define characteristic values:
gV_Re                     8000.0;   //[ - ] Re number (based on reference length)
gV_alpha_DEG              0;        //[ DEG ] Angle of Attak (AoA)
gV_vBLC                   0;        //[% of U_inf] Boundary Layer control velocity
gV_Tu                     0.01;     //[-] turbulence intensity

// Reference values
gV_l_ref                  1.0;  //[m] reference length (for Re)
gV_span                   1.0;  // [m] reference spanwise length (mesh width)
gV_p_inf                  0.0;  //[Pa]
gV_U_inf                  1.0;  //[m/s]
gV_rho_inf                1.0;  //[kg/m^3]

// Determin physical values:
gV_nu_air                 #eval{$gV_U_inf*$gV_l_ref/$gV_Re}; //[m^2/s]

// Determin wind system coordinates
gV_x_                     (#eval{cos(degToRad($gV_alpha_DEG))} #eval{sin(degToRad($gV_alpha_DEG))} 0);
gV_y_                     (#eval{-sin(degToRad($gV_alpha_DEG))} #eval{cos(degToRad($gV_alpha_DEG))} 0);
gV_UInlet                 (#eval{$gV_U_inf*cos(degToRad($gV_alpha_DEG))} #eval{$gV_U_inf*sin(degToRad($gV_alpha_DEG))} 0);

// Define setup variables (for use of multiple control dicts, fvSolution, etc. files)
gV_steadyStateStartTime   0;
gV_steadyStateEndTime     100000; 

// ************************************************************************* //
